<a href="https://colab.research.google.com/github/trevorwjames/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/Trevor_James_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-06-03 21:12:27--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.64.30
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.64.30|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.4’

instacart_online_gr 100%[===================>] 196.03M  47.5MB/s    in 4.6s

2020-06-03 21:12:31 (43.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.4’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [5]:
##### YOUR CODE HERE #####
# files we need: order_products_prior: cols- order id, product id, order_products_train: order id, product id, products: product_id, product_name

# importing first set 
import pandas as pd

order_products__prior = pd.read_csv('order_products__prior.csv')

order_products__prior.head()

order_products__prior_subset = order_products__prior[['order_id', 'product_id']]

order_products__prior_subset.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [9]:
# importing third set

products = pd.read_csv('products.csv')

products.head()

products.tail()

products_subset = products[['product_id', 'product_name']]

products_subset.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [12]:
order_name_id = pd.merge(order_products__prior_subset, products_subset, on='product_id')

order_name_id.head()

order_name_id.tail()

          order_id  product_id                    product_name
32434484   3265099       43492        Gourmet Burger Seasoning
32434485   3361945       43492        Gourmet Burger Seasoning
32434486   3267201       33097  Piquillo & Jalapeno Bruschetta
32434487   3393151       38977                  Original Jerky
32434488   3400803       23624     Flatbread Pizza All Natural

In [65]:
pd.set_option('display.max_rows', 20)

top10 = order_name_id['product_name'].value_counts()

top10.head(10)

Banana                    472565
Bag of Organic Bananas    379450
Organic Strawberries      264683
Organic Baby Spinach      241921
Organic Hass Avocado      213584
Organic Avocado           176815
Large Lemon               152657
Strawberries              142951
Limes                     140627
Organic Whole Milk        137905
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# 
'We can join/concatenate two strings together' + 'using "+" operator.'

import pandas as pd

df1 = pd.DataFrame({'a':[1,2,3,4], 'b':[4,5,6,7], 'c'[7,8,9,10]})

df2 = pd.DataFrame({'a':[6,4,8,7], 'b':[9,4,3,2], 'c'[1,6,2,9]})

df1.head()

df2.head()

by_rows = pd.concat([df1, df2])

by_rows

bt_rows.reset_index()

by_cols = pd.concat([df1, df2] axis=1)

by_cols

by_cols['a']

by_cols.columns = ['a1', 'b1', 'c1', 'a2', 'b2', 'c2']

by_cols

by_cols['a1']

df3 = pd.DataFrame({'a': [4,3,2,1], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df4 = pd.DataFrame({'a': [6,4,8,7,8], 'b': [9,4,3,2,1], 'd': [1,6,2,9,5]})

df3.head()

df4.head()

by_rows = pd.concat([df3, df4])

by_rows

by_cols = pd.concat([df3, df3], axis='cols')

by_cols

In [0]:
aisles = pd.read_csv('aisles.csv')
print(aisles.shape)
aisles.head()

departments = pd.read_csv('department.csv')
print(deparments.shape)
deparment.head()

order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

products = pd.read_csv('products.csv')
print(products.shape)
products.head()

order_products = pd.concat([order_products__prior, order_products__train])

print(order_products.shape)
order_products.head()

order_products__prior.shape

order_products__train.shape
order_products.shape

In [0]:
display(example)

order.head()

order_products.head()

products.head()

In [38]:
display(example)

condition = orders['order_id'] <= 5

orders[condition].head(5)

orders[order['order_id'] <=5].head(5)

order_products['order_id'] == 2539329

order_products_subset = order_products[(order_products['order_id'] == 253329) | (order_products['order_id'] == 2398795)]

order_products_subset.head()

orders_subset = orders[(orders['user_id'] == 1)& (orders['order_number'] <= 2)]

order_products_subset.head()

orders_and_products = pd.merge(order_subset, order_products_subset, on='order_id', how= 'inner')

orders_and_products.head(11)

display(example)

orders_and_products.head(11)

condition = products['product_id'].isin(orders_and_products['product_id'])

products_subset = products[condition]

products_subset.head()

products_subset = products_subset[['product_id', 'prodcut_name']]

products_subset.head()

final = pd.merge(products_subset, orders_and_products, on='product_id', how='inner')

final.head(11)

NameError: ignored

In [0]:
final = final.sort_values(by=['order_number', 'add_to_cart_order'])
final.head(11)

final = final[['user_id', 'order_id', 'order_number','order_dow', 'order_hour_of_day', 'add_to_cart_order', 'product_id', 'product_name']]
final.head(11)

final.columns = [column.replace('_', ' ')for column in final]

final.head(11)

display(example)

Above is the beginning of the lesson retyped by hand.

Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [42]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [48]:
# table2 -> reset index

table2 = table2.reset_index()

table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [49]:
# now to tidy

tidy = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])

tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [53]:
tidy1 = tidy.rename(columns={'index': 'treatment',
                            'variable': 'name',
                            'value': 'result'})
tidy1

    treatment          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [63]:
# tidy -> table2

wide = tidy1.pivot_table(index='treatment', columns='name', values='result')

wide

name        Jane Doe  John Smith  Mary Johnson
treatment
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [60]:
import seaborn as sns

flights = sns.load_dataset('flights')

flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [62]:
# Flights Pivot Table

flights_pivot = flights.pivot_table(index='year', columns='month', values='passengers')

flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [70]:
##### YOUR CODE HERE #####
# well I guess I need to read the instructions better, I went on a tangent
# I found all the products that are over 2900 orders
# I found out that there are 1963 products that are 2900 or more orders! haha


popular_products = pd.DataFrame(order_name_id['product_name'].value_counts())

popular_products.head()

                        product_name
Banana                        472565
Bag of Organic Bananas        379450
Organic Strawberries          264683
Organic Baby Spinach          241921
Organic Hass Avocado          213584

In [79]:
popular_products_reset = popular_products.reset_index()

popular_products_reset.head()

                    index  product_name
0                  Banana        472565
1  Bag of Organic Bananas        379450
2    Organic Strawberries        264683
3    Organic Baby Spinach        241921
4    Organic Hass Avocado        213584

In [80]:
popular_products1 = popular_products_reset.rename(columns={'index':'Product Name', 'product_name': 'Product Order Quantity'})

popular_products1.head()

             Product Name  Product Order Quantity
0                  Banana                  472565
1  Bag of Organic Bananas                  379450
2    Organic Strawberries                  264683
3    Organic Baby Spinach                  241921
4    Organic Hass Avocado                  213584

In [82]:
popular_products1_subset = popular_products1[(popular_products1['Product Order Quantity']>=2900)]

popular_products1_subset.tail()

                                       Product Name  Product Order Quantity
1959                 Organic Ice Cream Vanilla Bean                    2906
1960                        Organic Brussel Sprouts                    2905
1961                                   Wild Arugula                    2903
1962    Steamfresh Premium Selects Broccoli Florets                    2902
1963  Banana & Mango Organic Yogurt & Fruit Snacks                     2901

In [84]:
orders = pd.read_csv('orders.csv')

orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [91]:
late_orders = orders[(orders['order_hour_of_day']>=20)]
print(late_orders.shape)
late_orders.tail()

(283912, 7)

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
3421009   1060980   206207  ...                21                    30.0
3421025   2061009   206208  ...                20                    20.0
3421036    447879   206208  ...                23                     9.0
3421053   2789700   206208  ...                22                     4.0
3421067   1882108   206208  ...                22                     7.0

[5 rows x 7 columns]

In [0]:
# I need to use order_id in order to match the hour of the day to the products ordered
# So I would need to merge 3 data sets together in order to bring the hour or the day to the order id
# although brain is fried for today, need rest.

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####